The desired linked resource type.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public ExternalResourceType ResourceType { get; }
  Visual Basic
Public ReadOnly Property ResourceType As ExternalResourceType
	Get
  Visual C++
public:
property ExternalResourceType^ ResourceType {
	ExternalResourceType^ get ();
}
 See Also
  LinkedResourceOpeningEventArgs Class
  Autodesk.Revit.DB.Events Namespace